RQs/collection-code/wrk2-logs/w1_rate=3200_2026-02-26 19_18_52_output.txt
Running 10s test @ http://127.0.0.1:9090/wrk2-api/post/compose
  16 threads and 32 connections

  Thread calibration: mean lat.: 6.595ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 5.992ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 5.954ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.892ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.964ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.124ms, rate sampling interval: 21ms

-----------------------------------------------------------------------
Test Results @ http://127.0.0.1:9090/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.87ms    5.59ms  32.03ms   91.59%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.08ms
 75.000%    6.16ms
 90.000%   10.34ms
 99.000%   32.03ms
 99.900%   53.15ms
 99.990%   61.63ms
 99.999%   63.65ms
100.000%   63.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.760     0.000000            1         1.00
       2.665     0.100000         1983         1.11
       2.983     0.200000         3974         1.25
       3.277     0.300000         5945         1.43
       3.629     0.400000         7924         1.67
       4.077     0.500000         9907         2.00
       4.347     0.550000        10895         2.22
       4.691     0.600000        11891         2.50
       5.095     0.650000        12875         2.86
       5.563     0.700000        13869         3.33
       6.155     0.750000        14854         4.00
       6.515     0.775000        15353         4.44
       6.943     0.800000        15844         5.00
       7.467     0.825000        16341         5.71
       8.091     0.850000        16838         6.67
       9.047     0.875000        17332         8.00
       9.647     0.887500        17577         8.89
      10.343     0.900000        17824        10.00
      11.143     0.912500        18072        11.43
      12.263     0.925000        18319        13.33
      13.575     0.937500        18567        16.00
      14.479     0.943750        18691        17.78
      15.575     0.950000        18814        20.00
      16.959     0.956250        18938        22.86
      18.399     0.962500        19062        26.67
      20.271     0.968750        19187        32.00
      21.055     0.971875        19248        35.56
      22.399     0.975000        19310        40.00
      23.775     0.978125        19371        45.71
      25.503     0.981250        19433        53.33
      27.055     0.984375        19495        64.00
      28.175     0.985938        19527        71.11
      29.439     0.987500        19557        80.00
      31.231     0.989062        19588        91.43
      32.831     0.990625        19619       106.67
      35.807     0.992188        19650       128.00
      36.959     0.992969        19665       142.22
      38.015     0.993750        19681       160.00
      39.519     0.994531        19697       182.86
      40.415     0.995313        19712       213.33
      41.983     0.996094        19727       256.00
      43.071     0.996484        19735       284.44
      43.743     0.996875        19743       320.00
      44.991     0.997266        19750       365.71
      48.287     0.997656        19758       426.67
      50.207     0.998047        19766       512.00
      51.295     0.998242        19770       568.89
      51.583     0.998437        19774       640.00
      51.711     0.998633        19777       731.43
      52.511     0.998828        19781       853.33
      53.311     0.999023        19785      1024.00
      54.079     0.999121        19787      1137.78
      55.007     0.999219        19789      1280.00
      55.071     0.999316        19791      1462.86
      55.583     0.999414        19793      1706.67
      57.247     0.999512        19795      2048.00
      57.375     0.999561        19796      2275.56
      57.439     0.999609        19797      2560.00
      57.567     0.999658        19798      2925.71
      57.823     0.999707        19799      3413.33
      58.559     0.999756        19800      4096.00
      58.559     0.999780        19800      4551.11
      60.895     0.999805        19801      5120.00
      60.895     0.999829        19801      5851.43
      61.631     0.999854        19802      6826.67
      61.631     0.999878        19802      8192.00
      61.631     0.999890        19802      9102.22
      61.663     0.999902        19803     10240.00
      61.663     0.999915        19803     11702.86
      61.663     0.999927        19803     13653.33
      61.663     0.999939        19803     16384.00
      61.663     0.999945        19803     18204.44
      63.647     0.999951        19804     20480.00
      63.647     1.000000        19804          inf
#[Mean    =        5.867, StdDeviation   =        5.595]
#[Max     =       63.616, Total count    =        19804]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  31854 requests in 10.00s, 6.53MB read
Requests/sec:   3184.37  
Transfer/sec:    668.59KB